{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"GRU","config":{"units":50,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"gru1","trainable":true,"batch_input_shape":[null,25,4],"dtype":"float32"}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"softmax","trainable":true}}],"keras_version":"tfjs-layers 1.0.2","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.2","convertedBy":null,"weightsManifest":[{"paths":["./ux.weights.bin"],"weights":[{"name":"gru1/kernel","shape":[4,150],"dtype":"float32"},{"name":"gru1/recurrent_kernel","shape":[50,150],"dtype":"float32"},{"name":"gru1/bias","shape":[150],"dtype":"float32"},{"name":"softmax/kernel","shape":[50,4],"dtype":"float32"},{"name":"softmax/bias","shape":[4],"dtype":"float32"}]}]}