{
    "format": "layers-model",
    "generatedBy": "keras v2.2.4-tf",
    "convertedBy": "TensorFlow.js Converter v1.2.2.1",
    "modelTopology": {
        "keras_version": "2.2.4-tf",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_19",
                "layers": [
                    {
                        "class_name": "Embedding",
                        "config": {
                            "name": "embedding",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                5
                            ],
                            "dtype": "float32",
                            "input_dim": 14,
                            "output_dim": 2,
                            "embeddings_initializer": {
                                "class_name": "RandomUniform",
                                "config": {
                                    "minval": -0.05,
                                    "maxval": 0.05,
                                    "seed": null
                                }
                            },
                            "embeddings_regularizer": null,
                            "activity_regularizer": null,
                            "embeddings_constraint": null,
                            "mask_zero": false,
                            "input_length": 5
                        }
                    },
                    {
                        "class_name": "SimpleRNN",
                        "config": {
                            "name": "RNN",
                            "trainable": true,
                            "dtype": "float32",
                            "return_sequences": false,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "time_major": false,
                            "units": 50,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "recurrent_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.4
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_11",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_11",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.4,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "softmax",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 14,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "sparse_categorical_crossentropy",
            "metrics": [
                "accuracy"
            ],
            "weighted_metrics": null,
            "sample_weight_mode": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "RNN_18/kernel",
                    "shape": [
                        2,
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "RNN_18/recurrent_kernel",
                    "shape": [
                        50,
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "RNN_18/bias",
                    "shape": [
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_11/gamma",
                    "shape": [
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_11/beta",
                    "shape": [
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_11/moving_mean",
                    "shape": [
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_11/moving_variance",
                    "shape": [
                        50
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "embedding_18/embeddings",
                    "shape": [
                        14,
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "softmax_17/kernel",
                    "shape": [
                        50,
                        14
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "softmax_17/bias",
                    "shape": [
                        14
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}