{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"LSTM","config":{"units":50,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.10000000149011612,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm1","trainable":true,"batch_input_shape":[null,25,5],"dtype":"float32"}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"softmax","trainable":true}}],"keras_version":"tfjs-layers 1.1.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.1.0","convertedBy":null,"weightsManifest":[{"paths":["./ux.weights.bin"],"weights":[{"name":"lstm1/kernel","shape":[5,200],"dtype":"float32"},{"name":"lstm1/recurrent_kernel","shape":[50,200],"dtype":"float32"},{"name":"lstm1/bias","shape":[200],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[50],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[50],"dtype":"float32"},{"name":"softmax/kernel","shape":[50,3],"dtype":"float32"},{"name":"softmax/bias","shape":[3],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[50],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[50],"dtype":"float32"}]}]}